In [2]:
import pandas as pd

In [3]:
titanic=pd.read_csv('https://calmcode.io/static/data/titanic.csv')

In [3]:
print(titanic)

     survived  pclass                                               name  \
0           0       3                            Braund, Mr. Owen Harris
1           1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1       3                             Heikkinen, Miss. Laina
3           1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0       3                           Allen, Mr. William Henry
..        ...     ...                                                ...
709         0       3               Rice, Mrs. William (Margaret Norton)
710         0       2                              Montvila, Rev. Juozas
711         1       1                       Graham, Miss. Margaret Edith
712         1       1                              Behr, Mr. Karl Howell
713         0       3                                Dooley, Mr. Patrick

        sex   age     fare  sibsp  parch
0      male  22.0   7.2500      1      0
1    female  38.0  71.2833      1      0
2    female  26.0   7.9250      0      0
3    female  35.0  53.1000      1      0
4      male  35.0   8.0500      0      0
..      ...   ...      ...    ...    ...
709  female  39.0  29.1250      0      5
710    male  27.0  13.0000      0      0
711  female  19.0  30.0000      0      0
712    male  26.0  30.0000      0      0
713    male  32.0   7.7500      0      0

[714 rows x 8 columns]

In [4]:
titanic['sex']=='female'

0      False
1       True
2       True
3       True
4      False
       ...
709     True
710    False
711     True
712    False
713    False
Name: sex, Length: 714, dtype: bool

In [8]:
a=titanic[titanic['sex']=='female']
print(a)

     survived  pclass                                               name  \
1           1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1       3                             Heikkinen, Miss. Laina
3           1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
7           1       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
8           1       2                Nasser, Mrs. Nicholas (Adele Achem)
..        ...     ...                                                ...
703         1       1      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
704         1       2       Shelley, Mrs. William (Imanita Parrish Hall)
706         0       3                       Dahlberg, Miss. Gerda Ulrika
709         0       3               Rice, Mrs. William (Margaret Norton)
711         1       1                       Graham, Miss. Margaret Edith

        sex   age     fare  sibsp  parch
1    female  38.0  71.2833      1      0
2    female  26.0   7.9250      0      0
3    female  35.0  53.1000      1      0
7    female  27.0  11.1333      0      2
8    female  14.0  30.0708      1      0
..      ...   ...      ...    ...    ...
703  female  56.0  83.1583      0      1
704  female  25.0  26.0000      0      1
706  female  22.0  10.5167      0      0
709  female  39.0  29.1250      0      5
711  female  19.0  30.0000      0      0

[261 rows x 8 columns]

In [9]:
type(a)

pandas.core.frame.DataFrame

In [12]:
round(a['age'].mean(),2)

27.92

In [14]:
a[(a['sex']=='female') & (a['pclass']==1)]

,survived,pclass,name,sex,age,fare,sibsp,parch
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
10,1,1,"Bonnell, Miss. Elizabeth",female,58.0,26.5500,0,0
38,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,76.7292,1,0
46,1,1,"Icard, Miss. Amelie",female,38.0,80.0000,0,0
...,...,...,...,...,...,...,...,...
684,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,164.8667,1,1
689,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,25.9292,0,0
696,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,52.5542,1,1
703,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,83.1583,0,1
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0

In [21]:
a[(a['sex']=='female') & (a['pclass']==1)].shape

(85, 8)

In [22]:
a[(a['sex']=='female') & (a['pclass']>=2)].shape

(176, 8)

In [27]:
value=[3,4]
a[a['pclass'].isin(value)].shape

(102, 8)

# Basic Descriptive statistics

In [28]:
b=a['age']

In [29]:
b.mean()

27.915708812260537

In [31]:
b.describe()

count    261.000000
mean      27.915709
std       14.110146
min        0.750000
25%       18.000000
50%       27.000000
75%       37.000000
max       63.000000
Name: age, dtype: float64

In [32]:
a.describe()

         survived      pclass         age        fare       sibsp       parch
count  261.000000  261.000000  261.000000  261.000000  261.000000  261.000000
mean     0.754789    2.065134   27.915709   47.582759    0.639847    0.708812
std      0.431039    0.845560   14.110146   61.346854    0.928493    1.066752
min      0.000000    1.000000    0.750000    6.750000    0.000000    0.000000
25%      1.000000    1.000000   18.000000   13.000000    0.000000    0.000000
50%      1.000000    2.000000   27.000000   26.000000    0.000000    0.000000
75%      1.000000    3.000000   37.000000   57.979200    1.000000    1.000000
max      1.000000    3.000000   63.000000  512.329200    5.000000    6.000000

### Experiment 3 over